Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-38-42.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་ལ་མངོན་ཏུ་བལྟས་ཤིང་། སྙིང་རྗེ་སྐད་དུ་འོ་དོད་ཆེན་པོ་འབོད་དེ།
en: They stared at King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa and cried out in a great piteous clamor, ‘Your Majesty!

source: ལྷ་ཆེན་པོ་བདག་ཅག་ནི་ཉམས་ཐག་གོ །བཀྲེས་པ་དང་སྐོམ་པའི་སྡུག་བསྔལ་གྱིས་རབ་ཏུ་གཟིར་ཏོ།
en: We are in distress! The suffering of hunger and thirst pains us!

source: །འཇིགས་པ་སྣ་ཚོགས་ཀྱིས་གཡེན་སྤྱོའོ།
en: We are afflicted by various fears!

source: །བདག་ཅག་ལ་སྐྱབས་མ་མཆིས་སོ།
en: We have no refuge!

source: །བདག་ཅག་ལ་མགོན་དང་དཔུང་གཉེན་མ་མཆིས་སོ།
en: We have no protector or last resort!

source: །སྡུག་བསྔལ་གྱི་ཤིང་ཐགས་ཀྱིས་འཁོར་ཏོ།
en: We are walled around by suffering!

source: །སྲོག་ཆད་ལ་ཐུག་གོ །འཆི་བར་གྱུར་མ་ཁད་དོ།
en: We are losing our lives! We are facing death!’

source: །ཞེས་ཏེ་སྨྲེ་སྔགས་སྣ་ཚོགས་སུ་བླ་ཞིང་དབྱངས་ཀྱི་རྣམ་པ་སྣ་ཚོགས་དང་། ཚིག་སྣ་ཚོགས་ཀྱིས་ཁ་གདོང་མི་སྡུག་པར་གྱུར་པར་འདུ་ཤེས་དང་ཚིག་སྣ་ཚོགས་ཀྱི་ཐ་སྙད་དང་། ཆོ་མགྲེང་དང་སྐད་ཀྱི་གདངས་དོན་སྣ་ཚོགས་བརྗོད་པའི་ཚིག་དང་། ངག་གིས་འོ་དོད་བོས་སོ།
en: “In that way they wailed in various ways, crying out with various kinds of voices, with various words, various unpleasant facial expressions, various verbal expressions, terms of speech, and words from various dialects and in various accents.

source: །རྒྱལ་པོའི་གནས་དེའི་སྐྱེས་པ་དང་བུད་མེད་དང་ཁྱེའུ་དང་། བུ་མོ་བཀྲེས་པ་དང་སྐོམ་པས་མནར་བ་ལུས་ལ་རྒྱན་མེད་པ་སྒྲེན་མོ་གོས་མེད་པ། ཁ་དོག་དང་མདོག་མི་སྡུག་པ་ལུས་གས་ཤིང་རྩུབ་པ། སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་ལ། མི་དགའ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བདེ་བ་ནི་མངོན་པར་འདོད། སྡུག་བསྔལ་གྱི་འཇིགས་པས་ནི་བརླ་ཁྱེར་ནས་རྒྱལ་པོ་ཤེས་པའི་སྐྱེས་བུ་ཆེན་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ།
en: “All the men and women, boys and girls of that royal capital, who were tormented by hunger and thirst, whose bodies were devoid of jewelry, who had no clothes and were naked, who were unsightly and discolored, whose skin was cracked and rough, and who were suffering and unhappy, were in distress, yearning for happiness, and afraid of suffering.

source: དེ་ལ་བདེ་བ་ཐམས་ཅད་ཐོབ་པར་བྱ་བའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་ཐམས་ཅད་དང་མི་འགྲོགས་པར་བྱ་བའི་འདུ་ཤེས་དང་། འཚོ་བའི་བསམ་པ་དང་ལྡན་ཞིང་གཏེར་ཐོབ་པར་བྱ་བའི་འདུ་ཤེས་དང་། མུ་སྟེགས་མཐོང་བར་བྱ་བའི་འདུ་ཤེས་དང་། ལམ་ཆེན་པོ་ལ་ནན་ཏན་དུ་བྱ་བའི་འདུ་ཤེས་དང་། གྲུ་ཆེན་པོའི་འདུ་ཤེས་དང་། ཡེ་ཤེས་ཀྱི་གླིང་ཆེན་པོའི་འདུ་ཤེས་དང་། དོན་ཆེན་པོ་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་འདུ་ཤེས་དང་། མཐོ་རིས་ཀྱི་དགའ་བ་དང་བདེ་བ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་བྱ་བའི་འདུ་ཤེས་ཀྱིས་མགོན་དང་སྐྱབས་ཚོལ་བར་གྱུར་ཏོ།
en: Therefore, they sought protection from the great wise being King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa as a refuge, perceiving him to be someone through whom they could obtain happiness, perceiving him to be someone through whom they could become free of suffering, perceiving him to be someone through whom they could gain sustenance and obtain treasure, perceiving him to be like the sight of a ford, perceiving him to be a ship, perceiving him to be a great island of wisdom, perceiving him to be someone through whom they could attain a great benefit, and perceiving him to be someone through whom they could obtain all the joys and happiness of higher existences.

source: །རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པས་འཁོར་ཀུན་ནས་སློང་བ་མང་པོ་སྙིང་རྗེ་རྗེ་སྐད་དུ་འབོད་པའི་འོ་དོད་ཆེན་པོ་དེ་ཐོས་ནས། དེ་སྙིང་རྗེ་ཆེན་པོའི་སྒོ་བརྒྱ་སྟོང་གྲངས་མེད་པ་ཕྲག་བཅུ་ལ་ཞུགས་པར་གྱུར་ཏོ།
en: “When King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa heard the great clamor of the wailing of numerous piteous cries from all around him, he entered countless millions of gateways into great compassion.

source: །དེ་སྙིང་རྗེ་ཆེན་པོའི་ཚུལ་ཡིད་ལ་བབ་པའི་སེམས་སུ་གྱུར་ནས། ཡུད་ཙམ་ཞིག་རྩེ་གཅིག་ཏུ་བསམས་ཏེ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཚིག་བཅུ་བརྗོད་དོ།
en: His mind resting in the mental state that is the way of great compassion, he contemplated one-pointedly for a moment and then spoke ten sentences of great compassion.

source: །བཅུ་གང་ཞེ་ན།
en: What were those ten? They were:

source: ཀྱེ་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་ནི་འཁོར་བའི་གཡང་ས་ཆེན་པོར་ལྷུང་ཡང་སྐྱབས་མེད་པ་ལྟ་ན།
en: “ ‘Oh! I see these beings have fallen into the abyss of saṃsāra and are without a support.

source: བདག་ནམ་ཞིག་འཁོར་བའི་གཡང་ས་ཆེན་པོར་ལྷུང་བའི་སེམས་ཅན་རྣམས་དེ་བཞིན་གཤེགས་པའི་ས་ལ་དགོད་པས་གནས་སུ་འགྱུར།
en: When can I become a refuge for these beings, who have fallen into the great abyss of saṃsāra, and bring them to the level of the tathāgatas?

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་ཉོན་མོངས་པའི་གནོད་པས་གཙེས་ཤིང་སྐྱབས་མེད་པ་ལྟ་ན།
en: “ ‘Oh! I see these beings are oppressed by the torment of the kleśas and have no refuge.

source: ནམ་ཞིག་བདག་སེམས་ཅན་ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་འཇིགས་པ་དང་། གནོད་པས་གཙེས་ཏེ་སྐྱབས་མེད་པ་རྣམས་ཁ་ན་མ་ཐོ་བ་མེད་པའི་ལས་ཀྱི་མཐའ་ལ་འགོད་པས་སྐྱབས་སུ་འགྱུར།
en: When can I become a refuge for these beings, who are frightened by various kleśas, without a refuge, and oppressed by the torment of the kleśas, and establish them in irreproachable actions?

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་འཇིག་རྟེན་ན་རྒ་ཤིའི་འཇིགས་པས་ཚར་ཆོད་ཅིང་མགོན་མེད་པ་ལྟ་ན་ནམ་ཞིག་བདག་སེམས་ཅན་མགོན་མེད་པ་རྣམས་ཀྱི་འཁོར་བའི་འཇིགས་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་མགོན་དུ་འགྱུར།
en: “ ‘Oh! I see these beings are overcome by the fear of old age and death in this world and have no refuge. When can I become a refuge for these beings, who have no refuge, and dispel all their fear of saṃsāra?

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་འཇིག་རྟེན་གྱི་འཇིགས་པ་སྣ་ཚོགས་ཀྱིས་གཙེས་ཏེ།
en: “ ‘Oh! I see these beings are tormented by the various fears in this world and have no recourse.

source: རྟེན་མེད་པ་ལྟ་ན་ནམ་ཞིག་བདག་སེམས་ཅན་འཇིག་རྟེན་གྱི་འཇིགས་པ་སྣ་ཚོགས་ཀྱིས་གཙེས་པ་རྣམས་ཤིན་ཏུ་བདེ་ཞིང་སྐྱོན་མེད་པའི་ཐམས་ཅད་མཁྱེན་པའི་ལམ་ལ་འགོད་པས་རྟེན་དུ་འགྱུར།
en: When can I become a recourse for these beings, who are tormented by the various fears in the world, and establish them on the very happy and faultless path to omniscience?

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་འཇིག་རྟེན་ན་མ་རིག་པའི་མུན་པར་འཐོམས་ཏེ་ཐེ་ཚོམ་དང་ཡིད་གཉིས་ཀྱི་རབ་རིབ་ཀྱིས་བསྒྲིབས་པ་ལྟ་ན།
en: “ ‘Oh! I see these beings are enveloped in the darkness of ignorance in the world, and their sight is obscured by doubts and uncertainty.

source: ནམ་ཞིག་བདག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བས་སྒྲོན་མར་གྱུར་པར་འོང་།
en: When can I become a lamp for these beings who have no refuge and dispel all the darkness of their ignorance?

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་ནི་སྣང་བ་དང་བྲལ་བ་ལྟ་ན་ནམ་ཞིག་བདག་ཡེ་ཤེས་ཀྱི་སྒོ་རབ་རིབ་མེད་པར་ཡོངས་སུ་སྟོན་པས་ཡེ་ཤེས་ཆེན་པོའི་སྣང་བ་འབྱིན་པར་འགྱུར།
en: “ ‘Oh! I see these beings who are deprived of light. When can I provide them with the light of great wisdom by revealing to them the undarkened gateway to wisdom? “ ‘Oh!

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་འདི་དག་ནི་ཕྲག་དོག་དང་འཇུངས་པ་དང་། གཡོ་དང་སྒྱུའི་རྙོག་པས་བསམ་པ་རྙོག་པ་ཅན་དུ་གྱུར་ཏེ། ཡེ་ཤེས་ཀྱི་མདོག་གསལ་བ་མེད་པ་ལྟ་ན།
en: I see beings, deprived of the brilliant light of wisdom, who are polluted by envy and jealousy, deception and deceit.

source: ནམ་ཞིག་བདག་སེམས་ཅན་ཐམས་ཅད་ཤིན་ཏུ་དག་པ་ལ་རབ་ཏུ་འགོད་ཅིང་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཀྱི་མདོག་རབ་ཏུ་གསལ་བར་བྱེད་པར་འགྱུར།
en: When can I establish all beings in perfect purity and illuminate them with the brilliant light of the highest wisdom? “ ‘Oh!

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་གྱི་འཇིག་རྟེན་ནི་འཁོར་བའི་རྒྱ་མཚོའི་ཡུལ་གྱི་རྒྱུད་དུ་ཞུགས་ཤིང་འདྲེན་པ་མེད་པ་ལྟ་ན།
en: I see the world of beings, who are without guidance, without a guide.

source: ནམ་ཞིག་བདག་སེམས་ཅན་ཐམས་ཅད་ཆོས་རྒྱ་མཚོའི་ཚུལ་ལ་འཛུད་ཅིང་འདྲེན་པར་འགྱུར་བར་འོང་།
en: When can I bring all beings into the ways of the ocean of the Dharma and become their guide?

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་གྱི་འཇིག་རྟེན་མ་དུལ་ཞིང་རྣམ་པར་འདྲེན་པ་མེད་པ་ལྟ་ན།
en: “ ‘Oh! I see the world of beings, within the current of the ocean of saṃsāra, who are without a guide.

source: ནམ་ཞིག་བདག་སེམས་ཅན་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་སྨྱིན་པར་བྱ་བ་དང་། རྣམ་པར་གདུལ་བ་ལ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་དུས་ལས་མི་འདའ་ཞིང་རྣམ་པར་འདྲེན་པར་འགྱུར་བར་འོང་།
en: When can I ripen and guide all beings in every way, without missing the time for the blessing of the tathāgatas, and become their guide? “ ‘Oh!

source: ཀྱི་ཧུད་ཀྱེ་སེམས་ཅན་གྱི་འཇིག་རྟེན་ནི་དམུས་ལོང་དུ་གྱུར་ཏེ། ཡོངས་སུ་འདྲེན་པ་མེད་པ་ལྟ་ན།
en: I see the world of beings is blind and without a guide.

source: ནམ་ཞིག་བདག་སེམས་ཅན་ཐམས་ཅད་སྒྲིབ་པ་མེད་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཚུལ་ལ་འཛུད་ཅིང་ཡོངས་སུ་འདྲེན་པར་འགྱུར་དེ་སྐད་དུ་དེས་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་ཚིག་རྣམ་པ་བཅུ་བརྗོད་ནས་རྒྱལ་པོའི་གནས་དེར་དྲིལ་ཆེན་པོ་བརྡུངས་ཏེ། གཏོང་བ་ཆེན་པོའི་རྔ་བོ་ཆེ་ཡང་ཡོངས་སུ་བརྡུངས་ནས།
en: When can I bring all beings into the way of unobscured omniscient wisdom and become their guide?’ “After he had spoken these ten sentences of great compassion, the great bell of the royal capital was rung, and the great drum of the great gift-giving was beaten.

source: སུ་ཅི་འདོད་པ་དེ་ལ་དེ་སྦྱིན་གྱིས། འགྲོ་བ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་ཚིམ་པར་བྱའོ་ཞེས་སྒྲ་བརྗོད་དེ།
en: He declared, ‘I shall give whatever anyone desires, and I shall bring satisfaction to all beings.’

source: དེས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཀྱི་རྒྱལ་པོའི་གནས་ཐམས་ཅད་དང་། གྲོང་དང་གྲོང་ཁྱེར་དང་ལྗོངས་དང་། ཡུལ་དང་གྲོང་རྡལ་ཐམས་ཅད་དུ་ཡོ་བྱད་ཐམས་ཅད་ཀྱི་མཛོད་ཕྱེ་སྟེ། ལམ་གྱི་བཞི་མདོ་དང་། ལམ་གྱི་སུམ་མདོ་དང་སྲང་ཐམས་ཅད་དུ་ཡང་ཡོ་བྱད་སྣ་ཚོགས་ཀྱི་རྣམ་པ་མང་པོ་བཀོད་དེ་འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བར་བསྟབས་སོ།
en: “In all the royal capitals throughout Jambudvīpa, and in all the villages, towns, market towns, districts, countries, and cities, all the stores of requisites were opened, and many different kinds of requisites were arranged at all crossroads, at the junctions of three roads, and in streets, and all beings were provided with the necessities of life.

source: །མཛོད་དང་བང་བ་ཐམས་ཅད་ཀྱང་ཕྱེ་སྟེ། རིན་པོ་ཆེའི་གཏེར་ཆེན་པོ་དང་ཚོགས་ཀྱང་ཡོངས་སུ་བསྟན་ཏོ།
en: “All treasure houses and treasuries were opened, and a great accumulation of a treasure of jewels was displayed.

source: །རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཕུང་པོ་དུ་མ་ཡང་སྤུངས་སོ།
en: Many piles of various jewels were heaped up.

source: །ཟས་དང་སྐོམ་དང་། གོས་དང་བཞོན་པ་དང་མེ་ཏོག་དང་། ཕྲེང་བ་དང་བདུག་པ་དང་བྱུག་པ་དང་། ཕྱེ་མ་དང་གོས་རིན་པོ་ཆེ་ཁ་དོག་སྣ་ཚོགས་ཀྱི་མཛོད་ཕྱེ་ནས།
en: “Storehouses of food and drink, clothes, vehicles, flowers, garlands, incense and perfume, powders, jewelry, and precious clothes of various colors were opened.

source: ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། ཁྱིམ་མང་པོ་མལ་ཆ་དང་། སྟན་དང་གོས་ཀྱིས་ཡོངས་སུ་བརྒྱན་ཏེ། ནོར་དང་དབྱིག་ཐམས་ཅད་ཕུན་སུམ་ཚོགས་པར་བྱས་ནས། ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་གཟི་བརྗིད་རྣམ་པར་བཀོད་པས་མུན་པ་རྣམ་པར་སེལ་བ་བཤམས་ནས།
en: “There were mansions, divine palaces, and houses, adorned by beds, seats, and clothing, with a perfection of all wealth and treasure, and a display of kings of jewels that dispelled darkness with their brilliant radiance.

source: དེས་སེམས་ཅན་དེ་དག་ཅི་འདོད་པའི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། ཁྱིམ་དེ་དག་རེ་རེར་ཡང་རང་གི་ལུས་དང་འདྲ་བའི་སྤྲུལ་པའི་ལུས་མངོན་པར་སྤྲུལ་ཏེ་ཀུན་ཏུ་བཀོད་དོ།
en: “He emanated and displayed in each of those houses an emanation that resembled his body, so that he could fulfill all the wishes and desires of those beings.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་ནད་ཐམས་ཅད་གསོ་བའི་ཕྱིར་སྨན་པ་དང་། རིམ་གྲོ་བ་དང་། འཚོ་བའི་ཡོ་བྱད་སྣ་ཚོགས་ཀྱི་རྐྱེན་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་བཤམས་སོ།
en: “In order to heal all the illnesses of all beings, he arranged the perfect conditions of medicines, doctors, treatments, and the various requisites for sustaining life.

source: །རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྣོད་རྣམ་པ་ཐ་དད་པ་ཡོ་བྱད་སྣ་ཚོགས་ཀྱིས་ཅི་རིགས་སུ་བཀང་བ་དག་ཀྱང་ཉེ་བར་བཀོད་དེ།
en: “He also set out containers of different shapes, made of various precious materials, that contained every kind of the variety of requisites:

source: འདི་ལྟར་རིན་པོ་ཆེ་རྡོ་རྗེའི་སྣོད་ནི་སྤོས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བཀང་།
en: There were containers made of diamond jewels that were filled with various kinds of perfumed precious jewels.

source: སྤོས་ཀྱི་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྣོད་ནི་གོས་ཁ་དོག་དམ་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བཀང་ངོ་། །ཤིང་རྟ་མང་པོ་དབྱིབས་དང་། མདོག་སྣ་ཚོགས་སུ་འདུག་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: There were containers made of various perfumed precious jewels that were filled with clothes of various excellent colors.

source: རྟ་དང་གླང་པོ་དང་བ་ལང་ཅང་ཤེས་ལ་བཅས་པ། རིན་པོ་ཆེའི་ཤིང་རྟ་སྣ་ཚོགས་རྒྱལ་པོའི་རྐྱེན་དུ་རུང་བ། རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་གྱིས་ལོངས་སྤྱོད་དང་ལྡན་པ། སྟན་སྣ་ཚོགས་བཏིང་བ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྒྱན་པ། བླ་རེ་སྣ་ཚོགས་བྲེས་པ། རིན་པོ་ཆེའི་དྲིལ་བུའི་དྲ་བ་བྲེས་པ། གདུགས་དང་། རྒྱལ་མཚན་དང་བ་དན་བསྒྲེང་བས་བརྒྱན་པ་དག་གིས་ཀྱང་།
en: There were many chariots, set out throughout all the regions of the land, that were of various shapes and colors and adorned with various jewels, that had thoroughbred horses, oxen, and elephants —various precious chariots that were worthy of a king, made enjoyable with all adornments and jewels, set with various kinds of cushions, adorned with various jewels, covered with various canopies, hung with strings of precious bells, and adorned with upright parasols, banners, and flags.

source: ཡུལ་གྱི་ཕྱོགས་གང་བར་བཀོད་དོ། །གྲོང་དང་གྲོང་ཁྱེར་དང་། ལྗོངས་དང་ཡུལ་ཐམས་ཅད་སྦྱིན་པར་ཡང་འོ་དོད་ཀྱིས་བསྒོའོ།
en: He commanded that villages, towns, countrysides, and regions were to be given away.

source: །བཟའ་ཤིང་གི་ར་བ་དང་། ཀུན་དགའི་ར་བ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་སྣ་ཚོགས་ཡོངས་སུ་གཏང་བ་དང་། ཁྱིམ་དང་ཆུང་མ་དང་བུ་དང་བུ་མོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་། རིན་པོ་ཆེ་རིན་ཐང་མེད་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་། རང་གི་སྙིང་དང་རྐང་དང་རྒྱུ་མ་དང་མཁལ་མ་དང་ཚིལ་དང་། ཤ་དང་ཁྲག་དང་པགས་པ་དང་རྐ་ལག་དང་རྣ་བ་དང་། མིག་དང་སྣ་དང་ལྕེ་དང་སོ་དང་མཆུ་དང་མགོ་ཡོངས་སུ་བཏང་བ་ནས།
en: “He gave away various orchards, parks, and forests for ascetics. He gave away all his homes, wives, sons, and daughters. He gave away all his priceless jewels. He gave away his own heart, marrow, intestines, kidneys, fat, flesh, blood, skin, arms, legs, nose, eyes, ears, tongue, teeth, lips, and head.

source: ཕྱི་ནང་གི་དངོས་པོ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་གཏང་བར་ཡང་འོ་དོད་ཀྱིས་བསྒོའོ།
en: He commanded that every kind of every outer and inner thing was to be given away.

source: །དེས་ཡོ་བྱད་དེ་ལྟ་བུ་ཡོངས་སུ་གཏང་བའི་རྣམ་པ་མང་པོ་བཤམས་ཏེ་བསྩོགས་ནས་རྒྱལ་པོའི་གནས་རིན་པོ་ཆེའི་ས་ལས་རྣམ་པར་བརྒྱན་པ།
en: He had assembled and set out the many kinds of such gifts of requisites.

source: སྤྲིན་གྱི་སྒྲོན་མ་དེའི་ཤར་ཕྱོགས་ལོགས་ན་གྲོང་ཁྱེར་རིན་པོ་ཆེ་རྩེ་མོའི་གཟི་བརྗིད་ཅེས་བྱ་བའི་མདུན་རོལ་ནས་གཞི་མཉམ་པའི་ཕྱོགས་ཡངས་པ་ཆུ་ཞེང་དུ་རྒྱ་ཆེ་ཞིང་མཉམ་པ་མཐོན་དམན་མེད་པ།
en: To the east of the royal capital Ratna­sāla­vyūha­megha­pradīpā, in front of the city called Maṇi­śikhara­tejas, there was a vast level area of immense breadth, without any rise or fall.

source: རྣམ་པར་དག་ཅིང་གཞི་མཉམ་པ་ངམ་གྲོག་དང་གཡང་ས་དང་སྡོང་དུམ་དང་། ཚེར་མ་དང་། གསེག་མ་དང་། གྱོ་མོ་ཐམས་ཅད་མེད་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁམས་ལས་གྲུབ་པ།
en: It was pure and level ground free of ravines, crevasses, tree stumps, thorns, pebbles, and gravel. It consisted of a realm of all jewels.

source: གཞི་རིན་པོ་ཆེ་ཐམས་ཅད་ལས་བྱས་ཤིང་།
en: The ground was made from all jewels.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཐམས་ཅད་བཀྲམ་པ།
en: All kings of jewels were strewn over it.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱན་རྣམ་པ་དུ་མས་བརྒྱན་པ་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་གང་བ་ཕྱེ་མ་སྣ་ཚོགས་དྲི་ཤིན་ཏུ་ཞིམ་པའི་རྡུལ་ལྡང་བ།
en: It was adorned by many adornments of precious jewels.

source: བདུག་སྤོས་སྣ་ཚོགས་ཀྱིས་བདུགས་པ།
en: It was filled with various jewel flowers.

source: རིན་པོ་ཆེའི་སྒྲོན་མ་དཔལ་གྱི་གཟི་བརྗིད་ཅན་རབ་ཏུ་འབར་བ།
en: Various extremely aromatic powders rose up from it as dust.

source: སྤོས་དང་བདུག་སྤོས་ཐམས་ཅད་ཀྱི་ན་བུན་དང་། སྤྲིན་གྱི་ནམ་མཁའ་ཀུན་ཏུ་ཁེབས་པའི་རྒྱན་དང་ལྡན་པ།
en: There was a mist of perfumes and incense, and clouds of them formed an adornment that covered the entire sky.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤིང་གི་ཕྲེང་བ་ལེགས་པར་བཀྱེ་བས་མཛེས་པར་བརྒྱན་པ།
en: It was beautifully adorned by perfectly arranged lines of trees made of various precious materials.

source: ཁང་པ་དང་གཞལ་མེད་ཁང་དང་ཁང་པ་བརྩེགས་པ་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བརྒྱན་པ།
en: It was adorned by a variety of mansions, divine palaces, and kūṭāgāras.

source: གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ་རིན་པོ་ཆེའི་སྣམ་བུ་ལྡིང་བ།
en: The cloth of precious parasols, banners, and flags fluttered.

source: རྣམ་པར་སྣང་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་དྲ་བས་ཀུན་ནས་ཁེབས་པ།
en: It was covered with a network of shining flowers of various jewels.

source: རིན་པོ་ཆེའི་སྤོས་ཐམས་ཅད་ཀྱི་རྒྱལ་པོའི་དྲ་བའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་ཅན།
en: It had a network of the circular shapes of parasols made of the kings of all precious incenses.

source: གསེར་གྱི་དྲ་བ་ལས་རིན་པོ་ཆེའི་དྲིལ་བུ་འཁྲོལ་བ་དང་ལྡན་པ།
en: It had jingling golden strings of precious bells.

source: བླ་རེ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་མཛེས་པར་བྱས་པས་ཁེབས་པར་བྲེས་པ།
en: It was canopied over and beautified by various precious canopies.

source: སྤོས་ཀྱི་རྒྱལ་པོ་སྣ་ཚོགས་ཀྱི་ཕྱེ་མ་རྣམ་པར་བཀྲམ་པ།
en: It was strewn with powders of the various kings of incenses.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་སིལ་མས་དགའ་དགའ་ལྟར་གང་བ།
en: It was delightfully filled with the petals of jewels made of various jewels.

source: རོལ་མོ་བརྡུང་བ་དང་། དཀྲོལ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གི་སྒྲ་སྐད་ཡིད་དུ་འོང་བ་འབྱུང་བ།
en: It emitted the beautiful sound of a quintillion musical instruments being played and beaten.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རྒྱན་སྣ་ཚོགས་རྣམ་པར་དག་པས་རྣམ་པར་བརྒྱན་པ།
en: It was adorned by a pure variety of adornments made of all jewels.

source: བྱང་ཆུབ་སེམས་དཔའི་ལས་རྣམ་པར་སྨྱིན་པས་མངོན་པར་གྲུབ་པ་ཞིག་ཡོད་པ།
en: It had been created through the ripening karma of bodhisattvas.

source: དེའི་དབུས་སུ་སེང་གེའི་ཁྲི་ཆེན་པོ་རིན་པོ་ཆེ་སྣ་བཅུ་ལས་གྲུབ་པའི་སའི་གཞི་སྣ་ཚོགས་ལ་གནས་པ།
en: “In its center there was a great lion throne situated on a multicolored ground made of ten precious materials.

source: རིན་པོ་ཆེའི་ཁྲི་འཕང་སྣ་ཚོགས་བཅུའི་འཁོར་གྱིས་རྣམ་པར་མཛེས་པར་བྱས་པ།
en: It was magnificent in the center of a pavilion made of ten precious materials.

source: རིན་པོ་ཆེའི་ཤིང་ཡལ་ག་ཅན་བཅུས་སྟེགས་བུའི་མཚམས་རྣམ་པར་ཀླུབས་པའི་རྒྱན་མཛེས་པ་དང་ལྡན་པ།
en: It had the beautiful display of a well-arranged balustrade made from the branches of trees made of the ten jewels.

source: རྡོ་རྗེའི་འཁོར་ལོའི་སའི་གཞི་མི་ཤིགས་པ་ལ་རྐང་པ་རབ་ཏུ་རྟེན་པ།
en: It was set upon the surface of a circular platform of indestructible diamond.

source: རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་གཟུགས་དང་། མདོག་ཡོངས་སུ་འཛིན་པའི་སྟན་གྱི་འཁོར་ལོ་ཅན།
en: It had a circular cushion with a form and color made of all precious materials.

source: རིན་པོ་ཆེ་དུ་མ་ལས་བྱས་པའི་བོག་རེའི་རྒྱན་བརྒྱ་ཕྲག་དུ་མས་བརྒྱན་པ།
en: It was adorned by hundreds of crest adornments made of various precious materials.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཚོམ་བུ་རྣམ་པ་ཐ་དད་པའི་རྒྱན་གྱིས་ཤིན་ཏུ་བརྒྱན་པ་རིན་པོ་ཆེའི་རྒྱལ་མཚན་ཀུན་ནས་རྣམ་པར་ཕྱེ་སྟེ།
en: It was decorated by an array of inlays of different kinds made of many precious materials. Well-arranged precious banners had been erected all around it.

source: འབྲེལ་བར་བསྒྲེང་བ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་བ་དན་སྤྱངས་པ།
en: It was hung with flags made of various precious materials.

source: རྣམ་པ་ཐ་དད་པའི་རྒྱན་དང་ལྡན་པ། རིན་པོ་ཆེའི་དྲིལ་བུའི་དྲ་བས་བརྒྱན་པའི་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། གསེར་གྱི་དྲ་བ་སྣ་ཚོགས་རྣམ་པར་བྲེས་པ།
en: It was decorated with various kinds of decorations. It was adorned with nets of precious little bells. It was decorated with various divine jewels on strings of gold.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་མེ་ཏོག་གི་དྲ་བ་དང་། རིན་པོ་ཆེའི་རྒྱལ་པོ་ཆེན་པོའི་དྲ་བ་དང་། གོས་རིན་པོ་ཆེ་སྣ་ཚོགས་དང་། རིན་པོ་ཆེའི་དྲ་བས་ཅི་རིགས་སུ་ཀུན་ནས་བཀབ་ཅིང་མཛེས་པར་བྱས་པའི་རྒྱན་དང་ལྡན་པ། སྤོས་རིན་པོ་ཆེ་རྣམ་པ་ཐ་དད་པའི་ཚོགས་ལས་སྙིམ་པས་བཅུས་ཤིང་སྤོས་ཀྱི་སྤྲིན་མངོན་པར་གཏོར་བ།
en: It was covered with all kinds of beautifying arrays of nets of flowers made of various jewels, nets of great kings of jewels, nets of precious cloth, and nets of jewels. Handfuls of precious aromatic substances were scattered as clouds of perfume.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཁ་དོག་དང་དྲི་བསམ་གྱིས་མི་ཁྱབ་པ་ལས་བྱུང་བའི་དབྱིབས་ཡིད་དུ་འོང་བ་སྣ་ཚོགས་དང་། སྤོས་ཐམས་ཅད་ཀྱི་ན་བུན་དང་སྤྲིན་འབྱུང་བ།
en: Kings of jewels with inconceivable colors and aromas formed various beautiful shapes and emitted mists and clouds of all perfumes.

source: གམ་ཡོ་ནས་ལྷ་རྫས་ཀྱི་སྤོས་དང་། བདུག་སྤོས་སྣ་ཚོགས་ཀྱིས་རབ་ཏུ་བདུགས་པ།
en: It was perfumed by various present divine aromatic substances and incenses.

source: ལྷ་རྫས་ལས་ཀྱང་འདས་པའི་སྟན་རེག་ན་བདེ་བ་ཁ་དོག་བཟང་པོ་དུ་མ་ཅན་ལེགས་པར་བཏིང་བ།
en: The well-arranged seat of many excellent colors was pleasant to the touch, more so than those of the devas.

source: ལྷ་རྫས་ཀྱི་རོལ་མོ་དང་གླུ་སྙན་པ་ཡིད་དུ་འོང་བ་བརྒྱ་སྟོང་དུ་མའི་སྒྲ་ཀུན་ནས་འབྱུང་བ།
en: There arose all around the sound of the music of many hundreds of thousands of divine musical instruments and beautiful melodious songs.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཐེམ་སྐས་ཀྱི་ཕྲེང་བ་བ་དན་གྱིས་རྣམ་པར་ཀླུབས་པས།
en: It had the display of being adorned by a stairway of various precious materials covered with flags.

source: རབ་ཏུ་བརྒྱན་པའི་རྒྱན་དང་ལྡན་པ།
en: It was beautified by various precious stones.

source: རིན་པོ་ཆེའི་འབྲུའི་གཟུགས་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་སྤྲས་པ།
en: It shone with various miraculous lights. It was decorated with various precious forms composed of precious stones.

source: རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་སྣང་བར་བྱེད་པའི་འོད་དང་ལྡན་པ་མངོན་པར་གྲུབ་སྟེ།
en: It shone with light produced by various manifestations.

source: དེ་ལ་རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ།
en: “Seated upon it was King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa.

source: གཟུགས་བཟང་བ་ཤིན་ཏུ་མཛེས་པ།
en: He was very handsome, with an excellent body, and delightful to look at.

source: བལྟ་ན་སྡུག་པ་ཁ་དོག་བཟང་པོ་དམ་པ་རྒྱས་པ་དང་ལྡན་པ་མི་ཆེན་པོའི་མཚན་རྣམ་པར་དག་པ་རབ་ཏུ་ཐོབ་པ།
en: He possessed a completely excellent, beautiful color. He had attained the pure signs of a great being.

source: རིན་པོ་ཆེ་རྣམ་པར་སྣང་བའི་ཅོད་པན་ཅན།
en: He wore a crown that shone with jewels.

source: རྡོ་རྗེ་མཐུ་བོ་ཆེ་ལྟར་མ་ཁྲེགས་ཤིང་མི་ཤིགས་པའི་ལུས་དང་ལྡན་པ།
en: His body was as solid and indestructible as a powerful thunderbolt.

source: རྩིབ་མའི་མཚམས་ཐགས་བཟང་ཞིང་བརྟན་པར་འབྲེལ་བ།
en: His well-aligned ribs were strongly connected.

source: ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཡོངས་སུ་བཟང་བ་ཀུན་ནས་བཟང་བ། ཀུན་ནས་མཛེས་བ་ཀུན་ནས་སྡུག་པ།
en: The larger and smaller parts of his body were perfectly formed, completely excellent, completely beautiful, and completely splendid.

source: རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ།
en: He had obtained every perfect physical feature.

source: ཆོས་ཀྱི་རྒྱལ་པོ་ཆེན་པོའི་རིགས་སུ་བྱུང་བ།
en: He had been born into a great family of Dharma kings.

source: ཡོ་བྱད་ཐམས་ཅད་ལ་དབང་རབ་ཏུ་ཐོབ་པ།
en: He had obtained power over all requisites.

source: ཆོས་ཀྱི་དབང་ཤིན་ཏུ་རྣམ་པར་དག་པ།
en: He had the completely pure power of the Dharma.

source: རང་གི་སེམས་ལ་དབང་བསྒྱུར་བ།
en: He had power over his own mind.

source: ཚིག་གི་དཀྱིལ་འཁོར་ཁ་མ་བབ་པ།
en: He had an unimpeded range of speech.

source: མི་འཁྲུགས་པའི་ཡེ་ཤེས་དང་ལྡན་པ།
en: He had unshakable knowledge.

source: ཆོས་ཀྱི་སྦྱོར་བ་མ་ནོར་བ་ཤིན་ཏུ་བརྟན་པར་བྱས་པ།
en: He had perfectly established, unmistaken practice of the Dharma.

source: ཡོན་ཏན་དང་ལེགས་པ་མཐའ་ཡས་པར་བརྗོད་དུ་ཡོད་པ་དེ་འདུག་པར་གྱུར་ཏོ།
en: He revealed endless qualities and excellencies.

source: །རྒྱལ་པོ་ཆོས་ཐམས་ཅད་ཀྱི་ང་རོའི་གདུགས་ཀྱི་དཀྱིལ་འཁོར་རབ་ཏུ་སྒྲོག་པ་དེ་སེང་གེའི་ཁྲི་ཆེན་པོ་ལ་འདུག་པ་དང་། སྟེང་གི་སྤྱི་བོའི་ཐད་ཀའི་བར་སྣང་ལ་གདུགས་ཀྱི་དཀྱིལ་འཁོར་ཆེན་པོ་རིན་པོ་ཆེ་སྣ་ཚོགས་རྣམ་པར་འབེལ་བའི་ཡུ་བ་ཅན་ནོར་བུ་རིན་པོ་ཆེ་དམ་པའི་མཛོད་ཀྱི་སྙིང་པོ་དང་ལྡན་པ།
en: “King Sarva­dharma­nirnādacchatra­maṇḍala­nirghoṣa was seated upon the great lion throne and shaded, in the air directly above his head, by a great round parasol with a handle made of a blend of various precious materials and a treasure of excellent precious jewels in its center.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་ཤར་བུ་བརྒྱ་སྟོང་ལེགས་པར་བྲེས་པ།
en: It was adorned by a hundred thousand spokes of various jewels.
